# <p style="text-align: center;"> –ó–∞–¥–∞–Ω–∏–µ SQL </p>

**–¶–µ–ª—å –∏—Å—Å–ª–µ–¥–æ–≤–∞–Ω–∏—è:** –ø—Ä–æ–≤–µ—Å—Ç–∏ –∞–Ω–∞–ª–∏–∑ –¥–∞–Ω–Ω—ã—Ö —Å–µ—Ä–≤–∏—Å–∞ –∫–Ω–∏–≥ –∏ —Ä–µ—à–∏—Ç—å —Å–ª–µ–¥—É—é—â–∏–µ –∑–∞–¥–∞—á–∏:<br>

+ —Å–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞;
+ –ø–æ—Å—á–∏—Ç–∞—Ç—å –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏;
+ –æ–ø—Ä–µ–¥–µ–ª–∏—Ç—å –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü ‚Äî —á—Ç–æ–±—ã –∏—Å–∫–ª—é—á–∏—Ç–µ—å –∏–∑ –∞–Ω–∞–ª–∏–∑–∞ –±—Ä–æ—à—é—Ä—ã;
+ –æ–ø—Ä–µ–¥–µ–ª–∏—Ç—å –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞—è —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏;
+ –ø–æ—Å—á–∏—Ç–∞—Ç—å —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫.

# –û–ø–∏—Å–∞–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö

**–¢–∞–±–ª–∏—Ü–∞ `books`**<br>
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –∫–Ω–∏–≥–∞—Ö:<br>
`book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;<br>
`author_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;<br>
`title` ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–Ω–∏–≥–∏;<br>
`num_pages` ‚Äî –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Å—Ç—Ä–∞–Ω–∏—Ü;<br>
`publication_date` ‚Äî –¥–∞—Ç–∞ –ø—É–±–ª–∏–∫–∞—Ü–∏–∏ –∫–Ω–∏–≥–∏;<br>
`publisher_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—è.

**–¢–∞–±–ª–∏—Ü–∞ `authors`**<br>
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∞–≤—Ç–æ—Ä–∞—Ö:<br>
`author_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;<br>
`author` ‚Äî –∏–º—è –∞–≤—Ç–æ—Ä–∞.

**–¢–∞–±–ª–∏—Ü–∞ `publishers`**<br>
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞—Ö:<br>
`publisher_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;<br>
`publisher` ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;

**–¢–∞–±–ª–∏—Ü–∞ `ratings`**<br>
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ—Ü–µ–Ω–∫–∞—Ö –∫–Ω–∏–≥:<br>
`rating_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ—Ü–µ–Ω–∫–∏;<br>
`book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;<br>
`username` ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –æ—Å—Ç–∞–≤–∏–≤—à–µ–≥–æ –æ—Ü–µ–Ω–∫—É;<br>
`rating` ‚Äî –æ—Ü–µ–Ω–∫–∞ –∫–Ω–∏–≥–∏.

**–¢–∞–±–ª–∏—Ü–∞ `reviews`**<br>
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ–±–∑–æ—Ä–∞—Ö –Ω–∞ –∫–Ω–∏–≥–∏:<br>
`review_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ–±–∑–æ—Ä–∞;<br>
`book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;<br>
`username` ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –Ω–∞–ø–∏—Å–∞–≤—à–µ–≥–æ –æ–±–∑–æ—Ä;<br>
`text` ‚Äî —Ç–µ–∫—Å—Ç –æ–±–∑–æ—Ä–∞.

In [1]:
# –∏–º–ø–æ—Ä—Ç–∏—Ä—É–µ–º –±–∏–±–ª–∏–æ—Ç–µ–∫–∏
import pandas as pd
import sqlalchemy as sa
from sqlalchemy import inspect

In [2]:
# —É—Å—Ç–∞–Ω–∞–≤–ª–∏–≤–∞–µ–º –ø–∞—Ä–∞–º–µ—Ç—Ä—ã
db_config = {
'user': 'praktikum_student', # –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è
'pwd': 'Sdf4$2;d-d30pp', # –ø–∞—Ä–æ–ª—å
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # –ø–æ—Ä—Ç –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è
'db': 'data-analyst-final-project-db' # –Ω–∞–∑–≤–∞–Ω–∏–µ –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö
}
connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)
# —Å–æ—Ö—Ä–∞–Ω—è–µ–º –∫–æ–Ω–Ω–µ–∫—Ç–æ—Ä
engine = sa.create_engine(connection_string, connect_args={'sslmode':'require'})

# –ò–∑—É—á–µ–Ω–∏–µ –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏–∏ –æ —Ç–∞–±–ª–∏—Ü–∞—Ö

In [3]:
def data_head(query:str, engine:sa.engine.base.Engine=engine) -> pd.DataFrame:
    '''–§—É–Ω–∫—Ü–∏—è –¥–ª—è –≤—ã–≤–æ–¥–∞ –ø–µ—Ä–≤—ã—Ö 5 —Å—Ç—Ä–æ–∫ —Ç–∞–±–ª–∏—Ü—ã'''
    with engine.connect() as con:
        return pd.read_sql(sql=sa.text(query), con = con)

In [4]:
def data_count(query:str, engine:sa.engine.base.Engine=engine) -> pd.DataFrame:
    '''–§—É–Ω–∫—Ü–∏—è –¥–ª—è –≤—ã–≤–æ–¥–∞ –ø–æ–¥—Å—á–µ—Ç–∞ –∫–æ–ª–∏—á–µ—Å—Ç–≤–∞ —Å—Ç—Ä–æ–∫ —Ç–∞–±–ª–∏—Ü—ã'''
    with engine.connect() as con:
        return pd.read_sql(sql=sa.text(query), con = con)

In [5]:
insp = inspect(engine)
display(pd.DataFrame(insp.get_columns('books'))[['name','type']])

               name     type
0           book_id  INTEGER
1         author_id  INTEGER
2             title     TEXT
3         num_pages  INTEGER
4  publication_date     DATE
5      publisher_id  INTEGER

In [6]:
data_head('''SELECT * FROM books LIMIT 5''')

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

**–¢–∞–±–ª–∏—Ü–∞ `books` —Å–æ–¥–µ—Ä–∂–∏—Ç 1000 —Å—Ç—Ä–æ–∫ –∏ —Å–ª–µ–¥—É—é—â–∏–µ —Å—Ç–æ–ª–±—Ü—ã: `book_id`,`author_id`,`title`,`num_pages`,`publication_date`,`publisher_id`.**

In [7]:
display(pd.DataFrame(insp.get_columns('authors'))[['name','type']])

        name     type
0  author_id  INTEGER
1     author     TEXT

In [8]:
data_head('''SELECT * FROM authors LIMIT 5''')

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [9]:
data_count('''SELECT COUNT (*) FROM authors''')

   count
0    636

**–¢–∞–±–ª–∏—Ü–∞ `authors` —Å–æ–¥–µ—Ä–∂–∏—Ç 636 —Å—Ç—Ä–æ–∫ –∏ —Å–ª–µ–¥—É—é—â–∏–µ —Å—Ç–æ–ª–±—Ü—ã: `author_id`, `author`.**

In [10]:
display(pd.DataFrame(insp.get_columns('publishers'))[['name','type']])

           name     type
0  publisher_id  INTEGER
1     publisher     TEXT

In [11]:
data_head('''SELECT * FROM publishers LIMIT 5''')

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [12]:
data_count('''SELECT COUNT (*) FROM publishers''')

   count
0    340

In [13]:
display(pd.DataFrame(insp.get_columns('ratings'))[['name','type']])

        name     type
0  rating_id  INTEGER
1    book_id  INTEGER
2   username     TEXT
3     rating  INTEGER

**–¢–∞–±–ª–∏—Ü–∞ `publishers` —Å–æ–¥–µ—Ä–∂–∏—Ç 340 —Å—Ç—Ä–æ–∫ –∏ —Å–ª–µ–¥—É—é—â–∏–µ —Å—Ç–æ–ª–±—Ü—ã: `publisher_id`, `publisher`.**

In [14]:
data_head('''SELECT * FROM ratings LIMIT 5''')

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [15]:
data_count('''SELECT COUNT (*) FROM ratings''')

   count
0   6456

**–¢–∞–±–ª–∏—Ü–∞ `ratings` —Å–æ–¥–µ—Ä–∂–∏—Ç 6456 —Å—Ç—Ä–æ–∫ –∏ —Å–ª–µ–¥—É—é—â–∏–µ —Å—Ç–æ–ª–±—Ü—ã: `rating_id`, `book_id`, `username`, `rating`.**

In [16]:
display(pd.DataFrame(insp.get_columns('reviews'))[['name','type']])

        name     type
0  review_id  INTEGER
1    book_id  INTEGER
2   username     TEXT
3       text     TEXT

In [17]:
data_head('''SELECT * FROM reviews LIMIT 5''')

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

In [18]:
data_head('''SELECT COUNT (*) FROM reviews''')

   count
0   2793

**–¢–∞–±–ª–∏—Ü–∞ `reviews` —Å–æ–¥–µ—Ä–∂–∏—Ç 2793 —Å—Ç—Ä–æ–∫–∏ –∏ —Å–ª–µ–¥—É—é—â–∏–µ —Å—Ç–æ–ª–±—Ü—ã: `review_id`, `book_id`, `username`, `text`.**

* —Å–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞;
* –ø–æ—Å—á–∏—Ç–∞—Ç—å –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏;
* –æ–ø—Ä–µ–¥–µ–ª–∏—Ç—å –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü ‚Äî —á—Ç–æ–±—ã –∏—Å–∫–ª—é—á–∏—Ç–µ—å –∏–∑ –∞–Ω–∞–ª–∏–∑–∞ –±—Ä–æ—à—é—Ä—ã;
* —Ä–ø—Ä–µ–¥–µ–ª–∏—Ç—å –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞—è —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏;
* –ø–æ—Å—á–∏—Ç–∞—Ç—å —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫.

+ –°–¥–µ–ª–∞–π—Ç–µ –ø–æ –æ–¥–Ω–æ–º—É SQL-–∑–∞–ø—Ä–æ—Å—É –¥–ª—è —Ä–µ—à–µ–Ω–∏—è –∫–∞–∂–¥–æ–≥–æ –∑–∞–¥–∞–Ω–∏—è;
+ –í—ã–≤–µ–¥–∏—Ç–µ —Ä–µ–∑—É–ª—å—Ç–∞—Ç –∫–∞–∂–¥–æ–≥–æ –∑–∞–ø—Ä–æ—Å–∞ –≤ —Ç–µ—Ç—Ä–∞–¥–∫–µ;
+ –û–ø–∏—à–∏—Ç–µ –≤—ã–≤–æ–¥—ã –ø–æ –∫–∞–∂–¥–æ–π –∏–∑ —Ä–µ—à—ë–Ω–Ω—ã—Ö –∑–∞–¥–∞—á.

# –ó–∞–¥–∞—á–∞ 1. –°–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞

In [19]:
books_2000 = '''SELECT COUNT(*)
                FROM books
                WHERE publication_date >= '2000-01-01'
                '''

data_books_2000 = pd.io.sql.read_sql(books_2000, con = engine)
print('–ü–æ—Å–ª–µ 01 —è–Ω–≤–∞—Ä—è 2020 –≥–æ–¥–∞ –≤—ã—à–ª–∞ {} –∫–Ω–∏–≥–∞ '.format(data_books_2000.loc[0, 'count']))

–ü–æ—Å–ª–µ 01 —è–Ω–≤–∞—Ä—è 2020 –≥–æ–¥–∞ –≤—ã—à–ª–∞ 821 –∫–Ω–∏–≥–∞

<div class="alert alert-warning">
<b>–ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —Ä–µ–≤—å—é–µ—Ä–∞ v.1</b>
    
üìù –ï—Å–ª–∏ –ø–æ–¥—Ö–æ–¥–∏—Ç—å —Å—Ç—Ä–æ–≥–æ –∫ —ç—Ç–æ–º—É –∑–∞–ø—Ä–æ—Å—É, —Ç–æ –≤ –Ω–µ–º –º—ã –¥–æ–ª–∂–Ω—ã –±—ã–ª–∏ –≤—ã–≤–µ—Å—Ç–∏ –∑–Ω–∞—á–µ–Ω–∏—è –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000, —Ç.–µ. –Ω–µ –≤–∫–ª—é—á–∞—è —ç—Ç—É –¥–∞—Ç—É, –ø–æ—ç—Ç–æ–º—É –æ–ø–µ—Ä–∞—Ç–æ—Ä —Å—Ä–∞–≤–Ω–µ–Ω–∏—è –¥–æ–ª–∂–µ–Ω –±—ã—Ç—å `>`.

</div>

# –ó–∞–¥–∞—á–∞ 2. –î–ª—è –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏ –ø–æ—Å—á–∏—Ç–∞–π—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É

In [20]:
rating = '''SELECT b.title,
            COUNT (DISTINCT rw.review_id), ROUND (avg(r.rating), 2) as R
            FROM REVIEWS AS rw
            RIGHT OUTER JOIN BOOKS AS b ON rw.book_id=b.book_id
            LEFT OUTER JOIN RATINGS AS r ON b.book_id = r.book_id
            GROUP BY b.book_id
            ORDER BY R DESC'''

book_rating = pd.io.sql.read_sql(rating, con = engine)
book_rating.columns = ['–ù–∞–∑–≤–∞–Ω–∏–µ', '–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤', '–°—Ä–µ–¥–Ω–∏–π —Ä–µ–π—Ç–∏–Ω–≥']
book_rating

,–ù–∞–∑–≤–∞–Ω–∏–µ,–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤,–°—Ä–µ–¥–Ω–∏–π —Ä–µ–π—Ç–∏–Ω–≥
0,Arrows of the Queen (Heralds of Valdemar #1),2,5.00
1,The Walking Dead Book One (The Walking Dead #...,2,5.00
2,Light in August,2,5.00
3,Wherever You Go There You Are: Mindfulness Me...,2,5.00
4,Captivating: Unveiling the Mystery of a Woman'...,2,5.00
...,...,...,...
995,The World Is Flat: A Brief History of the Twen...,3,2.25
996,His Excellency: George Washington,2,2.00
997,Drowning Ruth,3,2.00
998,Junky,2,2.00
999,Harvesting the Heart,2,1.50

# –ó–∞–¥–∞—á–∞ 3. –û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü

In [21]:
books_max = '''SELECT p.publisher,
               COUNT(b.book_id)
               FROM publishers AS p
               JOIN BOOKS AS b ON p.publisher_id=b.publisher_id
               WHERE b.num_pages > 50
               GROUP BY p.publisher_id
               ORDER BY count(b.book_id) DESC
               LIMIT 1'''

max_books = pd.io.sql.read_sql(books_max, con = engine)
max_books.columns = ['–ù–∞–∑–≤–∞–Ω–∏–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞', '–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–Ω–∏–≥']
max_books

  –ù–∞–∑–≤–∞–Ω–∏–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞  –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–Ω–∏–≥
0         Penguin Books               42

# –ó–∞–¥–∞—á–∞ 4. –û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞–π—Ç–µ —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏

In [24]:
autor_max = '''SELECT a.author,
               AVG(r.rating) avg_rating
               FROM authors AS a
               JOIN books AS b ON a.author_id=b.author_id
               JOIN ratings AS r ON b.book_id=r.book_id
               WHERE b.book_id IN
                    (SELECT b.book_id
                     FROM books AS b
                     JOIN ratings AS r ON b.book_id=r.book_id
                     GROUP BY b.book_id
                     HAVING count(r.rating_id)>=50)
               GROUP BY a.author
               ORDER BY avg_rating desc
               LIMIT 1'''

max_autor = pd.io.sql.read_sql(autor_max, con = engine)
max_autor.columns = ['–ê–≤—Ç–æ—Ä', '–°—Ä–µ–¥–Ω–∏–π —Ä–µ–π—Ç–∏–Ω–≥']
max_autor
print('–ê–≤—Ç–æ—Ä —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ —ç—Ç–æ {} '.format('\033[1m' + max_autor.loc[0, '–ê–≤—Ç–æ—Ä']) )

–ê–≤—Ç–æ—Ä —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ —ç—Ç–æ J.K. Rowling/Mary GrandPr√©

                                                –ê–≤—Ç–æ—Ä  –°—Ä–µ–¥–Ω–∏–π —Ä–µ–π—Ç–∏–Ω–≥
0                          J.K. Rowling/Mary GrandPr√©         4.287097
1                   Markus Zusak/Cao Xu√¢n Vi·ªát Kh∆∞∆°ng         4.264151
2                                      J.R.R. Tolkien         4.246914
3                                   Louisa May Alcott         4.192308
4                                        Rick Riordan         4.080645
5                                     William Golding         3.901408
6                                       J.D. Salinger         3.825581
7            Paulo Coelho/Alan R. Clarke/√ñzdemir ƒ∞nce         3.789474
8   William Shakespeare/Paul Werstine/Barbara A. M...         3.787879
9                                          Lois Lowry         3.750000
10                                          Dan Brown         3.741259
11            George Orwell/Boris Grabnar/Peter ≈†kerl         3.729730
12                                    Stephenie Meyer         3.662500
13                                     John Steinbeck         3.622951

In [29]:
# —è—á–µ–π–∫–∞ —Ä–µ–≤—å—é–µ—Ä–∞:

autor_max = '''
-- –í –Ω–∞—á–∞–ª–µ –Ω–∞–π–¥–µ–º –∫–Ω–∏–≥–∏ –∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–µ–π—Ç–∏–Ω–≥ –¥–ª—è –∫–∞–∂–¥–æ–π –∏–∑ –Ω–∏—Ö
WITH book_r AS (
    SELECT 
        b.author_id,
        b.book_id,
        AVG(r.rating) avg_rating
    FROM books AS b
    JOIN ratings AS r ON b.book_id=r.book_id
    GROUP BY b.book_id
    HAVING count(r.rating_id)>=50
)

-- –ó–∞—Ç–µ–º —Å—á–∏—Ç–∞–µ–º —Å—Ä–µ–¥–Ω–∏–π —Ä–µ–π—Ç–∏–Ω–≥ –¥–ª—è –∫–∞–∂–¥–æ–≥–æ –∞–≤—Ç–æ—Ä–∞ –ø–æ —Å—Ä–µ–¥–Ω–µ–º—É —Ä–µ–π—Ç–∏–Ω–≥—É –∫–Ω–∏–≥
SELECT 
    a.author,
    AVG(br.avg_rating) avg_rating,
    COUNT(br.avg_rating) books_count -- –∏ –≤—ã–≤–µ–¥–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–Ω–∏–≥, –ø–æ –∫–æ—Ç–æ—Ä—ã–º –ø—Ä–æ—à–µ–ª –ø–æ–¥—Å—á–µ—Ç —Å—Ä–µ–¥–Ω–µ–≥–æ
FROM authors AS a
JOIN book_r AS br ON a.author_id=br.author_id

GROUP BY a.author
ORDER BY avg_rating desc

'''

max_autor = pd.io.sql.read_sql(autor_max, con = engine)
max_autor

                                               author  avg_rating  books_count
0                          J.K. Rowling/Mary GrandPr√©    4.283844            4
1                   Markus Zusak/Cao Xu√¢n Vi·ªát Kh∆∞∆°ng    4.264151            1
2                                      J.R.R. Tolkien    4.258446            2
3                                   Louisa May Alcott    4.192308            1
4                                        Rick Riordan    4.080645            1
5                                     William Golding    3.901408            1
6                                       J.D. Salinger    3.825581            1
7            Paulo Coelho/Alan R. Clarke/√ñzdemir ƒ∞nce    3.789474            1
8   William Shakespeare/Paul Werstine/Barbara A. M...    3.787879            1
9                                           Dan Brown    3.754540            2
10                                         Lois Lowry    3.750000            1
11            George Orwell/Boris Grabnar/Peter ≈†kerl    3.729730            1
12                                    Stephenie Meyer    3.662500            1
13                                     John Steinbeck    3.622951            1

# –ó–∞–¥–∞—á–∞ 5. –ü–æ—Å—á–∏—Ç–∞–π—Ç–µ —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫

In [23]:
mean_users = '''WITH A AS
                    (SELECT username,
                     COUNT(review_id)
                     FROM reviews
                     WHERE username in
                         (SELECT username
                          FROM ratings
                          GROUP BY username
                          HAVING count(rating_id)>48)
                    GROUP BY username)
                SELECT round (SUM (COUNT) / COUNT(COUNT), 2) AS AVG
                FROM A'''

users_mean = pd.io.sql.read_sql(mean_users, con = engine)

print ('–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫, —Å–æ—Å—Ç–∞–≤–ª—è–µ—Ç ', users_mean.loc[0, 'avg'])

–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫, —Å–æ—Å—Ç–∞–≤–ª—è–µ—Ç  24.0

**–í—ã–≤–æ–¥:**<br>
1. –ü–æ—Å–ª–µ 01 —è–Ω–≤–∞—Ä—è 2020 –≥–æ–¥–∞ –≤—ã—à–ª–∞ 821 –∫–Ω–∏–≥–∞;
2. –ü–æ—Å—á–∏—Ç–∞–Ω–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—è—è –æ—Ü–µ–Ω–∫–∞ –¥–ª—è –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏;
3. –ò–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ `Penguin Books`	–≤—ã–ø—É—Å—Ç–∏–ª–æ 42 –∫–Ω–∏–≥–∏, —ç—Ç–æ –º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ;
4. –ê–≤—Ç–æ—Ä —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ —ç—Ç–æ J.K. Rowling/Mary GrandPr√©;
5. –°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫, —Å–æ—Å—Ç–∞–≤–ª—è–µ—Ç  24.0